Revit 2024 API
StructuralSectionGeneralH Class
 Defines parameters for Rectangular Pipe structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class StructuralSectionGeneralH : StructuralSectionRectangular
Visual Basic
Public Class StructuralSectionGeneralH _
	Inherits StructuralSectionRectangular
Visual C++
public ref class StructuralSectionGeneralH : public StructuralSectionRectangular
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS
See Also
StructuralSectionGeneralH Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace